{
  "1917": {
    "info_density": 78,
    "info_density_reasoning": "The screenplay is remarkably lean for its length, with nearly every scene driving the central mission forward. Some atmospheric passages in No Man's Land and Ecoust could be trimmed slightly, but the real-time constraint justifies most descriptive elements. Dialogue is purposeful and sparse, rarely wasting words.",
    "payoff_rate": 85,
    "payoff_setups": "Blake's brother (setup repeatedly, paid off in final encounter); Schofield's medal/ribbon (discussed early, reveals character trauma); the milk canteen (found at farm, given to baby); cherry blossoms (Blake's orchard talk, river scene callback); Schofield's family photos (hinted at, revealed at end); trip wires (German trenches); flare gun (given by Leslie, used to signal); Blake's map skills (established, used throughout); Schofield's Somme experience (referenced, informs behavior); the poem/lullaby for the baby (shows paternal side, connects to final photo reveal)",
    "payoff_reasoning": "The screenplay demonstrates strong setup/payoff discipline. Major elements like Blake's brother, the medal backstory, and family photos all receive satisfying resolution. Minor setups like the milk and cherry blossoms create poetic resonance. A few setups (the dog tags, some war details) don't fully pay off, but most narrative threads close effectively.",
    "direction_pct": 72,
    "dialogue_pct": 28,
    "balance_rating": 9,
    "balance_reasoning": "The heavily skewed ratio toward direction is absolutely appropriate for this action-driven, real-time war thriller designed as a single shot. The visceral physical journey demands extensive visual description. Dialogue appears sparingly but with impact, matching the characters' exhausted, focused state and the genre's emphasis on survival over conversation.",
    "overall_craft_notes": "This is exceptionally disciplined screenwriting that understands its core conceit (real-time, single-shot) and builds everything to serve it. The structure is deceptively simple—linear geography as dramatic progression—but layered with emotional beats and thematic resonance. Character work is economical but effective, particularly Schofield's arc from reluctant participant to driven savior. The screenplay trusts visual storytelling over exposition, using physical obstacles as emotional metaphors. Pacing is relentless yet varied, with quiet character moments (baby scene, river) providing necessary breathing room. The ending avoids false sentiment, staying true to the war's grinding reality while delivering personal catharsis. Minor weaknesses include occasional over-description of action chaos and some repetitive trench navigation, but these are marginal in an otherwise masterfully constructed script.",
    "text_len": 120045,
    "title": "1917"
  },
  "Ford v Ferrari": {
    "info_density": 72,
    "info_density_reasoning": "The screenplay is generally efficient with strong narrative momentum, but contains some repetitive race descriptions and occasionally over-written action sequences. The opening Le Mans sequence and multiple pit stop scenes revisit similar beats. However, character introductions are economical and most scenes advance plot or deepen relationships meaningfully.",
    "payoff_rate": 85,
    "payoff_setups": "Shelby's heart condition (pills throughout, drives opening/closing), Miles' wrench throw (framed, returned to Peter), Miles' perfectionism (establishes character, tragic flaw in testing), Shelby's promise to Ford (sets up Miles being robbed), 7000 RPM monologue (bookends film), Miles teaching Peter the track (intimate moment before death), Ford II crying in car (humanizes antagonist), Ferrari's financial desperation (motivates rejection), Beebe as obstacle (consistent antagonist), Miles' tools being seized (economic stakes), the 'team player' conflict (thematic through-line)",
    "payoff_reasoning": "The screenplay demonstrates strong structural discipline with most major setups paying off, particularly the wrench, heart condition, and 7000 RPM motif. The Le Mans finish controversy is foreshadowed through Beebe's character arc. Some minor elements like Hansgen's rivalry and specific technical details don't fully resolve, but core emotional and thematic threads land effectively.",
    "direction_pct": 58,
    "dialogue_pct": 42,
    "balance_rating": 8,
    "balance_reasoning": "The ratio is well-suited for an action-driven racing drama. Extensive action lines effectively convey speed, danger, and technical detail that dialogue couldn't capture. The balance shifts appropriately—more dialogue in character-building scenes (Miles/Mollie, Shelby/Ford), more direction during races. Some racing sequences could be tighter, but the visual storytelling is largely justified.",
    "overall_craft_notes": "This is professionally crafted screenplay work with clear three-act structure, strong character arcs, and effective visual storytelling. The writers handle a large ensemble competently, giving distinct voices to Shelby, Miles, Beebe, and Ford II. Technical racing detail is integrated without overwhelming casual audiences. The emotional core (Miles' relationship with family and perfection) grounds the spectacle. Weaknesses include occasional redundancy in race sequences and some exposition-heavy corporate scenes. The ending sequence is particularly well-executed, paying off emotional and thematic setup while subverting expected triumph with tragedy. Dialogue is natural and period-appropriate without being overly stylized.",
    "text_len": 120045,
    "title": "Ford v Ferrari"
  },
  "The Irishman": {
    "info_density": 72,
    "info_density_reasoning": "The screenplay maintains strong narrative momentum with most scenes advancing plot or character. However, there are stretches of voiceover exposition that could be tighter, and some repetitive moments (multiple cigarette breaks, repeated explanations of mob protocol). The opening and closing frames are economical and purposeful.",
    "payoff_rate": 85,
    "payoff_setups": "Gold watch and ring introduced early, paid off throughout; prosciutto bread ritual established and repeated meaningfully; Peggy's fear of Russell/Frank set up early, paid off in her silence after Hoffa's death; 'what it is' phrase planted and used at critical moment; Russell's salad dressing scene mirrors earlier bread ritual; frozen fish in car creates alibi evidence; Port Clinton detour explained; 'when in doubt have no doubt' maxim repeated; door left open motif in opening paid off in closing; confession theme bookended",
    "payoff_reasoning": "The screenplay demonstrates strong structural discipline with recurring motifs (bread/wine, watches/rings, open doors) that accumulate meaning. Most planted elements—especially the relational dynamics between Frank, Russell, Jimmy, and Peggy—receive clear payoffs. A few minor setups (some prison characters, specific mob figures) fade without resolution, but core narrative threads are carefully woven and resolved.",
    "direction_pct": 55,
    "dialogue_pct": 45,
    "balance_rating": 8,
    "balance_reasoning": "The ratio appropriately serves this biographical crime epic. Heavy voiceover narration functions as essential exposition for spanning decades and explaining mob culture. Action lines are crisp and visual, rarely overwritten. Dialogue scenes breathe naturally while advancing plot. The balance shifts appropriately between contemplative moments and procedural sequences.",
    "overall_craft_notes": "This is professional, disciplined screenwriting demonstrating mastery of long-form biographical narrative structure. Zaillian efficiently compresses decades while maintaining clarity through voiceover framing, visual motifs, and strategic scene selection. The script shows restraint in violence depiction while building cumulative emotional weight. Character relationships deepen through repeated interactions rather than exposition. The circular structure (opening with video interrogation, closing in hospital with same) provides satisfying thematic closure. Minor weaknesses include occasional repetitive transitions and some scenes that could compress further, but overall this represents high-craft screenwriting with clear authorial control over complex material spanning 50+ years and dozens of characters.",
    "text_len": 120045,
    "title": "The Irishman"
  },
  "Jojo Rabbit": {
    "info_density": 78,
    "info_density_reasoning": "The screenplay is efficiently written with most scenes advancing plot or character. Some montages and comedic beats are slightly indulgent but serve tonal purposes. Action lines are generally tight, dialogue serves character and theme, and very few scenes feel expendable. The pacing justifies most inclusions.",
    "payoff_rate": 85,
    "payoff_setups": "DJ knife (taken by Elsa, held throughout, returns symbolically), shoelace tying motif (mother helps Jojo, Jojo helps Elsa at end), winking (Jojo can't wink, learns to wink perfectly at climax), rabbit metaphor (coward nickname becomes symbol of survival), Inga's papers/identity (setup early, pays off during Gestapo inspection), mother's resistance work (hinted, revealed, tragic payoff), letters from father (confiscated, delivered late, recontextualize his absence), Hitler as imaginary friend (evolves from idol to rejected figure), Elsa's drawings (recurring motif, emotional anchor)",
    "payoff_reasoning": "The screenplay demonstrates strong structural discipline with major setups receiving clear payoffs. The shoelace, winking, and rabbit motifs are particularly well-executed. A few minor elements (like some Hitler Youth training details) don't circle back, but the core emotional and thematic threads resolve satisfyingly.",
    "direction_pct": 55,
    "dialogue_pct": 45,
    "balance_rating": 9,
    "balance_reasoning": "The ratio is highly appropriate for this visual, character-driven dramedy. Extended sequences (opening montage, training camp, final liberation) rely on visual storytelling. Dialogue is purposeful and character-specific, never expository for its own sake. The balance allows cinematic moments to breathe while maintaining sharp verbal exchanges.",
    "overall_craft_notes": "This is a tightly structured screenplay with strong thematic coherence and exceptional use of recurring motifs. Waititi demonstrates mastery of tonal shifts—balancing satire, tragedy, and coming-of-age warmth without whiplash. The central conceits (imaginary Hitler, hidden Jewish girl, childish Nazi perspective) are executed with discipline and purpose. Character arcs are clear, particularly Jojo's evolution from ideologue to compassionate individual. The ending earns its emotional weight through careful setup. Minor weaknesses include some slightly protracted training sequences and a few comedic beats that could tighten, but overall this represents highly skilled screenplay craft with clear vision and confident execution.",
    "text_len": 120045,
    "title": "Jojo Rabbit"
  },
  "Joker": {
    "info_density": 78,
    "info_density_reasoning": "The screenplay is surprisingly lean for a character study, with most scenes directly advancing Arthur's psychological deterioration or establishing key relationships. Some repeated visual motifs (the laughing condition, clown makeup scenes) serve thematic purposes rather than padding. Occasional over-description of crowd scenes and protest imagery slightly bloat the middle act, but overall the narrative maintains strong forward momentum.",
    "payoff_rate": 85,
    "payoff_setups": "Gun from Randall (setup early, fires accidentally, used in finale); Arthur's journal (recurring motif, final blank pages reveal); Sophie relationship (imagined romance pays off with apartment reveal); Thomas Wayne letters (childhood trauma revelation); Mother's mental health records (identity crisis trigger); Wall Street guys singing 'Send in the Clowns' (callback in Murray shooting); Murray's mockery video (motivates finale); Arthur's scars (cutting smile wider at end); Orange cat (reflection detail, freed symbolically); Social worker's question about journal (bookended with hospital doctor)",
    "payoff_reasoning": "Nearly every planted element receives payoff, from the gun's accidental discharge foreshadowing Murray's shooting to the medical card establishing the laughing condition that becomes weaponized socially. The reveal that Sophie was imaginary recontextualizes earlier scenes brilliantly. The few elements not paid off (Gary's fate after witnessing Randall's murder) feel intentional rather than forgotten. The circular structure with interview rooms creates satisfying symmetry.",
    "direction_pct": 62,
    "dialogue_pct": 38,
    "balance_rating": 9,
    "balance_reasoning": "The direction-heavy approach is perfectly calibrated for this character study, allowing Joaquin Phoenix's physical performance to carry the narrative. Extended visual sequences (subway beating, apartment dance, hospital aftermath) communicate Arthur's isolation more effectively than dialogue could. When dialogue appears, it's purposeful and reveals character efficiently, particularly in the Murray Franklin climax where words finally matter.",
    "overall_craft_notes": "This is exceptionally disciplined character-driven screenwriting that trusts visual storytelling over exposition. The structural choice to bookend with interview scenes while leaving the middle section's reality ambiguous demonstrates sophisticated narrative control. Scene transitions are cinematic and purposeful (the 'quick cuts' of pill-taking, the musical montages). The gradual revelation technique—where earlier scenes are recontextualized by later information (Sophie, Penny's abuse records)—shows mastery of withheld information. Minor weaknesses include some on-the-nose protest imagery and occasionally repetitive beats in Arthur's humiliation cycle, but these serve the thematic descent into madness. The Murray Franklin sequence is a masterclass in building tension through confined space and real-time revelation.",
    "text_len": 120045,
    "title": "Joker"
  },
  "Little Women": {
    "info_density": 72,
    "info_density_reasoning": "The screenplay maintains strong narrative momentum with most scenes advancing character or plot. However, there are moments of redundancy—particularly in repetitive emotional beats about Jo's rejection of Laurie and some overly detailed stage directions describing actions that could be more economically stated. The dual-timeline structure is ambitious but occasionally creates padding when scenes echo each other without adding new information.",
    "payoff_rate": 85,
    "payoff_setups": "Jo's hair cutting (setup: vanity sacrifice; payoff: emotional release), the post office box with keys (setup: childhood communication; payoff: adult attempt to reconnect with Laurie), Amy burning Jo's novel (setup: sibling resentment; payoff: Amy's later self-sacrifice and maturity), Meg's glove (setup: romantic token; payoff: Mr. Brooke's devotion), Beth's scarlet fever (setup: Hummel visit; payoff: her eventual death), Friedrich's criticism of Jo's writing (setup: conflict; payoff: her maturation as writer), the ring from Aunt March (setup: inheritance promise; payoff: Amy's choices about marriage), Jo's rejection of Laurie (setup: independence; payoff: Amy-Laurie marriage and Jo's loneliness)",
    "payoff_reasoning": "The screenplay demonstrates excellent structural discipline with nearly all major setups receiving satisfying payoffs. The non-linear structure enhances this by allowing setups in one timeline to pay off in another. Minor elements like the post office and specific character traits established early are consistently harvested. Only a few minor setups (some of Jo's published stories, certain boarding house dynamics) don't receive full resolution.",
    "direction_pct": 48,
    "dialogue_pct": 52,
    "balance_rating": 9,
    "balance_reasoning": "The near-even split is exceptionally well-calibrated for a character-driven period drama. The action lines efficiently establish time, place, and emotional context without overwhelming the page, while the dialogue carries the ideological and emotional weight. The visual storytelling (burning manuscripts, the train station kiss, printing press montage) is given proper space to breathe, and the dual-timeline structure is clearly signaled through direction.",
    "overall_craft_notes": "This is a sophisticated, well-structured adaptation that uses non-linear storytelling to create thematic resonance between past innocence and present consequences. The screenplay demonstrates advanced craft in its use of parallels, visual motifs (fire, water, hands), and structural callbacks. Character voices are distinct and period-appropriate without feeling stilted. The meta-commentary on Jo as writer creating the story we're watching is elegantly woven throughout. Weaknesses include occasional over-explanation of emotional states that could be shown rather than told, and some scenes that linger past their narrative purpose. The ending's ambiguity between 'real' events and Jo's fiction is intentional but may frustrate some readers. Overall, this represents professional-level screenwriting with strong authorial voice and thematic clarity.",
    "text_len": 120045,
    "title": "Little Women"
  },
  "Marriage Story": {
    "info_density": 72,
    "info_density_reasoning": "The screenplay is generally efficient, with most scenes serving character development or narrative progression. However, there are moments of redundancy (multiple scenes establishing the same character traits in the opening montage, some repetitive lawyer meetings) and occasionally over-written passages that could be tightened without loss of meaning.",
    "payoff_rate": 85,
    "payoff_setups": "Nicole's love letters (read at start, returned at end), Charlie's knife trick (introduced early, payoff with evaluator), the unopened tea mugs (establishes character, reinforces domesticity), Mary Ann the stage manager (planted as flirty, confirmed affair), Nicole wanting to direct (mentioned early, gets Emmy nomination), Charlie's competitiveness (shown in tennis, echoed in divorce), Nicole's strong arms/jar opening (intimate detail paid off in emotional recognition), Stuart Little reading (tears foreshadow emotional connection), haircut intimacy (beginning and near-end), shoe-tying (final intimate gesture)",
    "payoff_reasoning": "The screenplay demonstrates strong structural discipline with most planted elements receiving meaningful payoffs. The love letters frame the entire narrative beautifully, and smaller details like the knife trick and haircut scenes create powerful emotional echoes. A few minor setups (Tums addiction, some family dynamics) receive less satisfying resolution, but overall the setup-payoff architecture is sophisticated.",
    "direction_pct": 45,
    "dialogue_pct": 55,
    "balance_rating": 9,
    "balance_reasoning": "The ratio is exceptionally well-calibrated for an intimate character drama. The action lines provide essential visual storytelling (facial expressions, physical gestures, spatial relationships) that complement rather than duplicate dialogue. The screenplay breathes, allowing silence and behavior to convey as much as words, which is crucial for depicting a disintegrating marriage.",
    "overall_craft_notes": "This is sophisticated screenwriting that demonstrates mastery of visual storytelling, thematic coherence, and emotional architecture. Baumbach uses the frame device brilliantly, plants details that resonate across the narrative, and trusts actors/directors to fill in gaps. The dialogue feels naturalistic while serving multiple purposes (character, plot, theme). The screenplay's greatest strength is its ability to show a relationship's complexity without resorting to melodrama—even the climactic argument feels earned and specific. Minor weaknesses include occasional verbosity in lawyer scenes and some repetitive establishment of character traits early on. The craft is professional and purposeful throughout, with particularly strong work in visual motifs (tea cups, open cabinets, the knife) and spatial storytelling (New York vs LA, proximity and distance between characters).",
    "text_len": 120045,
    "title": "Marriage Story"
  }
}